docs/hp16.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
# ######################################################################################################################################################.H.S.##
# FILE:        readme.org
#+TITLE:       HP Voyager Programs
#+SUBTITLE:    ForHP-16C
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2024-02-03
#+DESCRIPTION: Various programs for HP Voyager series calculators
#+KEYWORDS:    Hewlett Packard RPN RPL
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil
#+SEQ_TODO:    TODO:NEW(t)                         TODO:WORK(w)    TODO:HOLD(h)    | TODO:FUTURE(f)   TODO:DONE(d)    TODO:CANCELED(c)
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
# Change max-width to get wider output -- also note #content style below
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>.subtitle { font-size: 0.6em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_HEAD: <style>blockquote { margin-bottom: 0.5em; padding: 0.5em; background-color: #FFF8DC; border-left: 2px solid #A5573E; border-left-color: rgb(255, 228, 102); display: block; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 5em; margin-inline-end: 5em; } </style>
# Change the following to get wider output -- also note body style above
#+HTML_HEAD: <style>#content { max-width: 60em; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/voyager/
# ######################################################################################################################################################.H.E.##

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|          <r> | <l>                                 |
|    *Author:* | /{{{author}}}/                      |
|   *Updated:* | /{{{modification-time(%Y-%m-%d)}}}/ |
| *Generated:* | /{{{time(%Y-%m-%d)}}}/              |
#+ATTR_HTML: :align center
Copyright \copy {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#+INCLUDE: emacs.org

* Introduction
:PROPERTIES:
:CUSTOM_ID: intro
:END:

I have one "big" program on my HP-16C & DM-16L calculators with 7 entry points:

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
| *=LBL=* | *Function* | *Description*                                  |
|---------+------------+------------------------------------------------|
| *=A=*   | *=SLn=*    | Shift y left by x bits                         |
| *=B=*   | *=SRn=*    | Shift y right by x bits                        |
| *=C=*   | *=ctz=*    | Count Trailing Zeros                           |
| *=E=*   | *=iLog=*   | Integer logarithm: $\mathrm{floor}(\log_2(x))$ |
| *=F=*   | *=WSIZE=*  | Recall the WSIZE value                         |
| *=2=*   | *=2^x=*    | Compute $2^x$                                  |
| *=1=*   | *=LSSB=*   | Clear all but least significant set bit        |

** Stack Diagrams

#+BEGIN_CENTER
*=SLn=* -- Shift y left by x bits
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>       |
|      | *Before* | *After*   |
| *T:* | t        | ?         |
| *Z:* | z        | ?         |
| *Y:* | y        | ?         |
| *X:* | n        | SLn(y, n) |
#+BEGIN_CENTER
*=SRn=* -- Shift y right by x bits
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>       |
|      | *Before* | *After*   |
| *T:* | t        | ?         |
| *Z:* | z        | ?         |
| *Y:* | y        | ?         |
| *X:* | n        | SRn(y, n) |
#+BEGIN_CENTER
*=ctz=* -- Count Trailing Zeros
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>     |
|      | *Before* | *After* |
| *T:* | t        | ?       |
| *Z:* | z        | ?       |
| *Y:* | y        | ?       |
| *X:* | x        | CTZ(x)  |
#+BEGIN_CENTER
*=iLog=* -- Integer logarithm: $\mathrm{floor}(\log_2(x))$
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>     |
|      | *Before* | *After* |
| *T:* | t        | ?       |
| *Z:* | z        | ?       |
| *Y:* | y        | ?       |
| *X:* | x        | iLog(x) |
#+BEGIN_CENTER
*=WSIZE=* -- Recall the WSIZE value
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>     |
|      | *Before* | *After* |
| *T:* | t        | y       |
| *Z:* | z        | y       |
| *Y:* | y        | x       |
| *X:* | x        | WSIZE   |
#+BEGIN_CENTER
*=2^x=* -- Compute $2^x$
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>     |
|      | *Before* | *After* |
| *T:* | t        | z       |
| *Z:* | z        | z       |
| *Y:* | y        | y       |
| *X:* | x        | $2^x$   |
#+BEGIN_CENTER
*=LSSB=* -- Clear all but least significant set bit
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>     |
|      | *Before* | *After* |
| *T:* | t        | y       |
| *Z:* | z        | y       |
| *Y:* | y        | y       |
| *X:* | x        | LSSB(x) |

