docs/hp16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-17 Sat 15:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>HP Voyager Programs</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Various programs for HP Voyager series calculators" />
<meta name="keywords" content="Hewlett Packard RPN RPL" />
<meta name="generator" content="Org Mode" />

















</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/voyager/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">HP Voyager Programs
<br />
<span class="subtitle">ForHP-16C</span>
</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2024-02-14</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2024-02-17</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2024 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#intro">1. Introduction</a>
<ul>
<li><a href="#org2664900">1.1. Stack Diagrams</a></li>
<li><a href="#orgee04a9b">1.2. Program Listing</a></li>
</ul>
</li>
<li><a href="#org0437ad6">2. Meta Data</a></li>
</ul>
</div>
</div>

<div id="outline-container-intro" class="outline-2">
<h2 id="intro"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
I have one "big" program on my HP-16C &amp; DM-16L calculators with 7 entry points:
</p>

<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b><code>LBL</code></b></th>
<th scope="col" class="org-left"><b>Function</b></th>
<th scope="col" class="org-left"><b>Description</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><code>A</code></b></td>
<td class="org-left"><b><code>SLn</code></b></td>
<td class="org-left">Shift y left by x bits</td>
</tr>

<tr>
<td class="org-left"><b><code>B</code></b></td>
<td class="org-left"><b><code>SRn</code></b></td>
<td class="org-left">Shift y right by x bits</td>
</tr>

<tr>
<td class="org-left"><b><code>C</code></b></td>
<td class="org-left"><b><code>ctz</code></b></td>
<td class="org-left">Count Trailing Zeros</td>
</tr>

<tr>
<td class="org-left"><b><code>E</code></b></td>
<td class="org-left"><b><code>iLog</code></b></td>
<td class="org-left">Integer logarithm: \(\mathrm{floor}(\log_2(x))\)</td>
</tr>

<tr>
<td class="org-left"><b><code>F</code></b></td>
<td class="org-left"><b><code>WSIZE</code></b></td>
<td class="org-left">Recall the WSIZE value</td>
</tr>

<tr>
<td class="org-left"><b><code>2</code></b></td>
<td class="org-left"><b><code>2^x</code></b></td>
<td class="org-left">Compute \(2^x\)</td>
</tr>

<tr>
<td class="org-left"><b><code>1</code></b></td>
<td class="org-left"><b><code>LSSB</code></b></td>
<td class="org-left">Clear all but least significant set bit</td>
</tr>
</tbody>
</table>
</div>
