docs/hp16.html

<div id="outline-container-org0437ad6" class="outline-2">
<h2 id="org0437ad6"><span class="section-number-2">2.</span> Meta Data</h2>
<div class="outline-text-2" id="text-2">
<p>
The primary URL for this page: <a href="https://richmit.github.io/voyager/hp16.html">https://richmit.github.io/voyager/hp16.html</a>
</p>

<p>
The org mode file for this page: <a href="https://github.com/richmit/voyager/blob/main/docs/hp16.org">https://github.com/richmit/voyager/blob/main/docs/hp16.org</a>
</p>

<p>
The HTML file for this page: <a href="https://github.com/richmit/voyager/blob/main/docs/hp16.html">https://github.com/richmit/voyager/blob/main/docs/hp16.html</a>
</p>

<p>
The github repository housing this content: <a href="https://github.com/richmit/voyager/">https://github.com/richmit/voyager/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>